spec/dummy/app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= f.label :author_id %><br />
    <%= f.select :author_id, Author.all.collect {|a| [ a.to_s, a.id ] }, :prompt => true %>