spec/dummy/app/controllers/books_controller.rb

INSERT INTO "books" ("author_id", "created_at", "description", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author_id", nil], ["created_at", Fri, 06 Jun 2014 13:21:20 UTC +00:00], ["description", nil], ["price", nil], ["title", "MyString"], ["updated_at", Fri, 06 Jun 2014 13:21:20 UTC +00:00]]
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "author_id" = 0, "updated_at" = '2014-06-06 15:18:11.263277' WHERE "books"."id" = 1
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])